* Accounts  
** DONE day <2018-08-01 Mer>
   :PROPERTIES:
   :total:    345
   :END:
   
   | sum | 345 |
   #+TBLFM: $2=remote(expenses<2018-08-01 Mer>,@2$2)

   #+NAME: expenses<2018-08-01 Mer>
   |-----------+-------+-------------|
   | item      | price | note        |
   |-----------+-------+-------------|
   | total     |   345 |             |
   |-----------+-------+-------------|
   | breakfast |    65 | Noodle Chen |
   |-----------+-------+-------------|
   | lunch     |    90 | Xiao Fu     |
   |-----------+-------+-------------|
   | dinner    |    90 | MAJI        |
   |-----------+-------+-------------|
   | beverage  |   100 | Yi Fang     |
   |-----------+-------+-------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-02 Jeu>
   :PROPERTIES:
   :total:    194
   :END:
   
   | sum | 194 |
   #+TBLFM: $2=remote(expenses<2018-08-02 Jeu>,@2$2)

   #+NAME: expenses<2018-08-02 Jeu>
   |-----------+-------+--------------|
   | item      | price | note         |
   |-----------+-------+--------------|
   | total     |   194 |              |
   |-----------+-------+--------------|
   | breakfast |    64 | Yi Ji Shuang |
   |-----------+-------+--------------|
   | dinner    |   130 | big pot      |
   |-----------+-------+--------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-03 Ven>
   :PROPERTIES:
   :total:    275
   :END:
   
   | sum | 275 |
   #+TBLFM: $2=remote(expenses<2018-08-03 Ven>,@2$2)

   #+NAME: expenses<2018-08-03 Ven>
   |--------+-------+--------------|
   | item   | price | note         |
   |--------+-------+--------------|
   | total  |   275 |              |
   |--------+-------+--------------|
   | lunch  |    65 | Noodle Chen  |
   |--------+-------+--------------|
   | dinner |   123 | big pot      |
   |--------+-------+--------------|
   | snack  |    87 | Night Market |
   |--------+-------+--------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-04 Sam>
   :PROPERTIES:
   :total:    388
   :END:
   
   | sum | 388 |
   #+TBLFM: $2=remote(expenses<2018-08-04 Sam>,@2$2)

   #+NAME: expenses<2018-08-04 Sam>
   |-----------+-------+-------------------------|
   | item      | price | note                    |
   |-----------+-------+-------------------------|
   | total     |   388 |                         |
   |-----------+-------+-------------------------|
   | breakfast |    65 | I JY Sheng              |
   |-----------+-------+-------------------------|
   | lunch     |    90 | Taiwan Chicken Leg King |
   |-----------+-------+-------------------------|
   | snack     |   138 | A LOT OF PLACES         |
   |-----------+-------+-------------------------|
   | dinner    |    95 | Seafood                 |
   |-----------+-------+-------------------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-05 Dim>
   :PROPERTIES:
   :total:    610
   :END:
   
   | sum | 610 |
   #+TBLFM: $2=remote(expenses<2018-08-05 Dim>,@2$2)

   #+NAME: expenses<2018-08-05 Dim>
   |--------------+-------+----------------|
   | item         | price | note           |
   |--------------+-------+----------------|
   | total        |   610 |                |
   |--------------+-------+----------------|
   | brunch       |   240 | Happy Sunlight |
   | snack        |    65 | How Sweet      |
   | train ticket |   305 | Pu Yo Ma       |
   |--------------+-------+----------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-06 Lun>
   :PROPERTIES:
   :total:    198
   :END:
   
   | sum | 198 |
   #+TBLFM: $2=remote(expenses<2018-08-06 Lun>,@2$2)

   #+NAME: expenses<2018-08-06 Lun>
   |--------+-------+----------------|
   | item   | price | note           |
   |--------+-------+----------------|
   | total  |   198 |                |
   |--------+-------+----------------|
   | brunch |    78 | I Ji Shen      |
   |--------+-------+----------------|
   | dinner |   120 | TAIWAN VIETNAN |
   |--------+-------+----------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-07 Mar>
   :PROPERTIES:
   :total:    298
   :END:
   
   | sum | 298 |
   #+TBLFM: $2=remote(expenses<2018-08-07 Mar>,@2$2)

   #+NAME: expenses<2018-08-07 Mar>
   |----------+-------+-----------------|
   | item     | price | note            |
   |----------+-------+-----------------|
   | total    |   298 |                 |
   |----------+-------+-----------------|
   | brunch   |    78 | I JY SHEN       |
   |----------+-------+-----------------|
   | beverage |    55 | Blueder         |
   |----------+-------+-----------------|
   | dinner   |   115 | four directions |
   |----------+-------+-----------------|
   | snack    |    50 | Night Market    |
   |----------+-------+-----------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-08 Mer> :account:
   :PROPERTIES:
   :total:    208
   :END:
   
   | sum | 208 |
   #+TBLFM: $2=remote(expenses<2018-08-08 Mer>,@2$2)

   #+NAME: expenses<2018-08-08 Mer>
   |----------+-------+------------------------------------|
   | item     | price | note                               |
   |----------+-------+------------------------------------|
   | total    |   208 |                                    |
   |----------+-------+------------------------------------|
   | brunch   |    80 | I JY SHENG                         |
   |----------+-------+------------------------------------|
   | beverage |    38 | 8%                                 |
   |----------+-------+------------------------------------|
   | dinner   |    90 | Night Market in front of the house |
   |----------+-------+------------------------------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-09 Jeu> :account:
   :PROPERTIES:
   :total:    190
   :END:
   
   | sum | 190 |
   #+TBLFM: $2=remote(expenses<2018-08-09 Jeu>,@2$2)

   #+NAME: expenses<2018-08-09 Jeu>
   |-----------+-------+--------------|
   | item      | price | note         |
   |-----------+-------+--------------|
   | total     |   190 |              |
   |-----------+-------+--------------|
   | breakfast |    50 | Spicy Noodle |
   |-----------+-------+--------------|
   | dinner    |    90 | MAJI         |
   |-----------+-------+--------------|
   | beverage  |    50 | 8%           |
   |-----------+-------+--------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

** DONE day <2018-08-10 Ven> :account:
   :PROPERTIES:
   :total:    450
   :END:
   
   | sum | 450 |
   #+TBLFM: $2=remote(expenses<2018-08-10 Ven>,@2$2)

   #+NAME: expenses<2018-08-10 Ven>
   |-----------+-------+-------------------------------------|
   | item      | price | note                                |
   |-----------+-------+-------------------------------------|
   | total     |   450 |                                     |
   |-----------+-------+-------------------------------------|
   | breakfast |    70 | I JY SHENG                          |
   |-----------+-------+-------------------------------------|
   | lunch     |   150 | Hello Café, at 3rd Floor of Xiao Fu |
   |-----------+-------+-------------------------------------|
   | dinner    |   190 | Barkers                             |
   |-----------+-------+-------------------------------------|
   | beverage  |    40 | Tea Tank                            |
   |-----------+-------+-------------------------------------|
   #+TBLFM: @2$2=vsum(@3$2..@>$2)

* Summary
  The total cost for this month:
  #+BEGIN_SRC emacs-lisp :exports results
    (defun org-get-account-all ()
      (tabularize_day (mapcar 'string-to-number
			      (seq-filter 'non-null
					  (org-map-entries (lambda ()
							     (org-entry-get nil "TOTAL")))))))

    (defun tabularize_week (a_list)
      "summarize and tabularize"
      (let ((count 1)
	    (day '((1 0)))
	    (day_count 1))
	(dolist (elem a_list day)
	  (setq count (+ 1 count))
	  (if (= (% count 7) 0)
	      (progn
		(setq day_count (+ 1 day_count))
		(add-to-list 'day `(,day_count 0))))
	  (setf (cdr (assoc day_count day)) (list (+ (cadr (assoc day_count day)) elem))))))

    (defun tabularize_day (a_list)
      "summarize and tabularize"
      (let ((day '())
	    (day_count 1))
	(dolist (elem a_list day)
	  (progn
	    (add-to-list 'day `(,day_count ,elem))
	    (setq day_count (+ 1 day_count))))))

    (defun non-null (x)
      "Filter function"
      (not (null x)))

    (defun graphication (a-list)
      "Make a graph"
      (mapcar (lambda (xs)
		(let* ((real-value (cadr xs))
		       (value-part (/ real-value 10)))
		  (setf (cadr xs) (if (> value-part 90)
				      (concat (make-list 90 ?-))
				    (concat (make-list value-part ?-))))
		  (append xs (list (format "%d" real-value)))))
	      a-list))

    (setq total-list (org-get-account-all))

    (add-to-list 'total-list `("all" ,(apply '+ (mapcar 'cadr total-list))))

    (graphication total-list)
  #+END_SRC

  #+RESULTS:
  | all | ------------------------------------------------------------------------------------------ | 3156 |
  |  10 | ---------------------------------------------                                              |  450 |
  |   9 | -------------------                                                                        |  190 |
  |   8 | --------------------                                                                       |  208 |
  |   7 | -----------------------------                                                              |  298 |
  |   6 | -------------------                                                                        |  198 |
  |   5 | -------------------------------------------------------------                              |  610 |
  |   4 | --------------------------------------                                                     |  388 |
  |   3 | ---------------------------                                                                |  275 |
  |   2 | -------------------                                                                        |  194 |
  |   1 | ----------------------------------                                                         |  345 |

